---
kind: event
id: E:Autodesk.Revit.UI.AddInCommandBinding.BeforeExecuted
source: html/1a0b276f-37f0-e800-e1a7-ecf4446c414f.htm
---
# Autodesk.Revit.UI.AddInCommandBinding.BeforeExecuted Event

Occurs before the command associated with this AddInCommandBinding executes.

## Syntax (C#)
```csharp
public event EventHandler<BeforeExecutedEventArgs> BeforeExecuted
```